ziyiz/DIY-Sim-Racing-FFB-Pedal-Customed/ESP32/src/Main.cpp
              }
              
              // trigger system identification
              if (dap_actions_st.payloadPedalAction_.startSystemIdentification_u8)
              {
                systemIdentificationMode_b = true;
              }
              // trigger Custom effect effect 1
              if (dap_actions_st.payloadPedalAction_.Trigger_CV_1)
              {
                CV1.trigger();
              }
              // trigger Custom effect effect 2
              if (dap_actions_st.payloadPedalAction_.Trigger_CV_2)
              {
                CV2.trigger();
              }
              // trigger return pedal position
              if (dap_actions_st.payloadPedalAction_.returnPedalConfig_u8)
              {
                DAP_config_st * dap_config_st_local_ptr;
                dap_config_st_local_ptr = &dap_config_st;
                //uint16_t crc = checksumCalculator((uint8_t*)(&(dap_config_st.payLoadHeader_)), sizeof(dap_config_st.payLoadHeader_) + sizeof(dap_config_st.payLoadPedalConfig_));
                crc = checksumCalculator((uint8_t*)(&(dap_config_st.payLoadHeader_)), sizeof(dap_config_st.payLoadHeader_) + sizeof(dap_config_st.payLoadPedalConfig_));
                dap_config_st_local_ptr->payloadFooter_.checkSum = crc;
                Serial.write((char*)dap_config_st_local_ptr, sizeof(DAP_config_st));
                Serial.print("\r\n");
              }
              if(dap_actions_st.payloadPedalAction_.Rudder_action==1)
              {
                if(dap_calculationVariables_st.Rudder_status==false)
                {
                  dap_calculationVariables_st.Rudder_status=true;
                  Serial.println("Rudder on");
                  moveSlowlyToPosition_b=true;
                  //Serial.print("status:");
                  //Serial.println(dap_calculationVariables_st.Rudder_status);
                }
                else
                {
                  dap_calculationVariables_st.Rudder_status=false;
                  Serial.println("Rudder off");
                  moveSlowlyToPosition_b=true;
                  //Serial.print("status:");
                  //Serial.println(dap_calculationVariables_st.Rudder_status);
                }
              }
              if(dap_actions_st.payloadPedalAction_.Rudder_brake_action==1)
              {
                if(dap_calculationVariables_st.rudder_brake_status==false&&dap_calculationVariables_st.Rudder_status==true)
                {
                  dap_calculationVariables_st.rudder_brake_status=true;
                  Serial.println("Rudder brake on");
                  //Serial.print("status:");
                  //Serial.println(dap_calculationVariables_st.Rudder_status);
                }
                else
                {
                  dap_calculationVariables_st.rudder_brake_status=false;
                  Serial.println("Rudder brake off");
                  //Serial.print("status:");
                  //Serial.println(dap_calculationVariables_st.Rudder_status);
                }
              }


            }

            break;
          case sizeof(Basic_WIfi_info) : 
          Serial.println("get basic wifi info");
          Serial.readBytes((char*)&_basic_wifi_info, sizeof(Basic_WIfi_info));
          #ifdef OTA_update
            if(_basic_wifi_info.device_ID==dap_config_st.payLoadPedalConfig_.pedal_type)
            {
              SSID=new char[_basic_wifi_info.SSID_Length+1];
              PASS=new char[_basic_wifi_info.PASS_Length+1];
              memcpy(SSID,_basic_wifi_info.WIFI_SSID,_basic_wifi_info.SSID_Length);
              memcpy(PASS,_basic_wifi_info.WIFI_PASS,_basic_wifi_info.PASS_Length);
              SSID[_basic_wifi_info.SSID_Length]=0;
              PASS[_basic_wifi_info.PASS_Length]=0;
              OTA_enable_b=true;
            }
          #endif
          
          break;
          default:

            // flush the input buffer
            while (Serial.available()) Serial.read();
            //Serial.flush();

            Serial.println("\nIn byte size: ");
            Serial.println(n);
            Serial.println("    Exp config size: ");
            Serial.println(sizeof(DAP_config_st) );
            Serial.println("    Exp action size: ");
            Serial.println(sizeof(DAP_actions_st) );

            break;  


            

        }
      }


      // send pedal state structs
      // update pedal states
      printCycleCounter++;
      DAP_state_basic_st dap_state_basic_st_lcl;
      DAP_state_extended_st dap_state_extended_st_lcl;

      if(semaphore_updatePedalStates!=NULL)
      {
        
        if(xSemaphoreTake(semaphore_updatePedalStates, (TickType_t)1)==pdTRUE) 
        {
        
          // UPDATE basic pedal state struct
          dap_state_basic_st_lcl = dap_state_basic_st;

          // UPDATE extended pedal state struct
          dap_state_extended_st_lcl = dap_state_extended_st;
            
          // release semaphore
          xSemaphoreGive(semaphore_updatePedalStates);

        }
      }
      else
      {
        semaphore_updatePedalStates = xSemaphoreCreateMutex();
      }



      // send the pedal state structs
      // send basic pedal state struct
      if ( !(dap_config_st.payLoadPedalConfig_.debug_flags_0 & DEBUG_INFO_0_STATE_BASIC_INFO_STRUCT) )
      {
        if (printCycleCounter >= 2)
        {
          printCycleCounter = 0;
          Serial.write((char*)&dap_state_basic_st_lcl, sizeof(DAP_state_basic_st));
          Serial.print("\r\n");
        }
      }

      if ( (dap_config_st.payLoadPedalConfig_.debug_flags_0 & DEBUG_INFO_0_STATE_EXTENDED_INFO_STRUCT) )
      {
        Serial.write((char*)&dap_state_extended_st_lcl, sizeof(DAP_state_extended_st));
        Serial.print("\r\n");
      }

    }

    delay( SERIAL_COOMUNICATION_TASK_DELAY_IN_MS );
    if(semaphore_updateJoystick!=NULL)
    {
      if(xSemaphoreTake(semaphore_updateJoystick, (TickType_t)1)==pdTRUE)
      {
         //Serial.print(" 3");
        joystickNormalizedToInt32_local = joystickNormalizedToInt32;
        xSemaphoreGive(semaphore_updateJoystick);
      }
    }
    if (IsControllerReady()) 
    {
      if(dap_calculationVariables_st.Rudder_status==false)
      {
        //general output
        SetControllerOutputValue(joystickNormalizedToInt32_local);
      }
    }

    #ifdef PRINT_TASK_FREE_STACKSIZE_IN_WORDS
      if( communicationTask_stackSizeIdx_u32 == 1000)
			{
				UBaseType_t stackHighWaterMark = uxTaskGetStackHighWaterMark(NULL);
				Serial.print("StackSize (Serial communication): ");
				Serial.println(stackHighWaterMark);
				communicationTask_stackSizeIdx_u32 = 0;
			}
			communicationTask_stackSizeIdx_u32++;
    #endif

